{
  "jobs": {
    "frontend_engineer": {
      "title": "Senior Frontend Engineer (Angular)",
      "department": "Engineering",
      "slug": "frontend-engineer",
      "description": "We're looking for an experienced frontend developer to join the Foodkit team. You'll use the latest versions of Angular to build performant and responsive user interfaces for restaurant owners/operators and their customers.<br><br>You'll be helping us to build out new features on a number of codebases, including consumer facing websites, back-of-house content management systems and even hybrid mobile applications. Our customers use our platform to operate their business online so it's crucial we provide rock-solid software that works across a broad range of devices and operating systems.<br><br>As a remote worker, you can pick where and when you work, as long as you stay productive and we have some overlapping hours to do standups.",
      "responsibilities": [
        "Collaborate with the CEO and CTO to design, plan and build frontend solutions to solve real-world problems for restaurant owners/operators.",
        "Write performant and maintainable frontend code with a focus on re-use and testability.",
        "Integrate with existing RESTful APIs, and help detail requirements of new APIs where necessary.",
        "Help us to plan and estimate projects based on business needs (communicated through user stories and functional requirements).",
        "Advocate the latest frontend technologies and standards within the team to ensure we are always using the best tools and techniques.",
        "Join (quick) daily stand-up meetings using video conferencing tools (Skype, Slack, Appear.in).",
        "Take part in code reviews and technical discussions."
      ],
      "experiences": [
        "Multiple years working in a professional software development environment.",
        "Strong skills in ES6/TypeScript development, as well as a deep understanding of associated frontend tooling (NPM, webpack, babel, linters).",
        "Experience working with LARGE Single Page web Applications (SPAs) using either Angular, React, Vue.js or a similar framework.",
        "Knowledge of agile software development practices and concepts (scrum/kanban, unit testing, continuous integration, etc...)",
        "Functional knowledge of Git and GitHub.",
        "Proficient English communication skills, both written and spoken.",
        "A passion for restaurants, cuisine or just good food in general. For bonus points include your favourite cuisine or dish in your intro email."
      ],
      "link": "mailto:careers@foodkit.io?subject=Frontend%20Engineer"
    },
    "api_engineer": {
      "title": "Backend API Engineer (Laravel)",
      "department": "Engineering",
      "slug": "api-engineer",
      "description": "We're looking for a seasoned backend developer to help us maintain and expand our suite of internal and external APIs for the restaurant industry. Our RESTful API services multiple clients (mobiles apps, websites, third-party services) so experience with API versioning, caching and token-based security mechanisms is a must. You'll be designing, documenting, building and deploying RESTful JSON APIs on a daily basis.<br><br>As a remote worker, you can pick where and when you work, as long as you stay productive and we have some overlapping hours to do standups.",
      "responsibilities": [
        "Work with the CTO to architect scalable web solutions.",
        "Mentor other developers, encouraging them to develop their skills and expertise.",
        "Continuously ship real value to the end user.",
        "Deliver performant, maintainable and tested systems.",
        "Work with the team to plan and estimate project timelines and delivery dates.",
        "Join (quick) daily stand-up meetings using video conferencing tools (Skype, Slack, Appear.in).",
        "Help to refine and develop the processes and procedures of the engineering team."
      ],
      "experiences": [
        "Multiple years working in a professional software development environment.",
        "Proven track record of delivering software with <i>agility</i>.",
        "Strong skills in PHP (5+) development.",
        "Experience building large web applications using MVC frameworks, preferably Laravel 5+",
        "Experience building RESTful JSON APIs for consumption by single page web applications.",
        "Understanding of patterns and techniques for building scalable back-end infrastructure (caching, client rate limiting, authentication and authorization schemes).",
        "Functional knowledge of Git and GitHub.",
        "Proficient English communication skills, both written and spoken.",
        "An active interest in exploring and using other backend languages (Golang, Elixir, Node, etc.)",
        "A passion for restaurants, cuisine or just good food in general. For bonus points include your favourite cuisine or dish in your intro email."
      ],
      "link": "mailto:careers@foodkit.io?subject=API%20Engineer"
    }
  }
}
